Repository: djangocon/2025.djangocon.africa
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: French
fr: Français

source: Notes to the reviewer. These notes will not be displayed publicly
fr: Remarques pour l'évaluateur. Ces remarques resteront privés

source: Are there other speakers involved in your talk? List only their email addresses here
fr: D'autres intervenants participent ils à votre présentation? Mettez ici leurs adresses e-mail

source: A Description of the file.
fr: Description du dossier.

source: The name of the sponsorship package.
fr: Le nom de la formule de sponsoring.

source: Currency symbol of the sponsorship package.
fr: Le symbole de la devise de la formule de sponsoring.

source: The amount of the sponsorship package.
fr: Le montant de la formule de sponsoring.

source: A short description of the sponsorship package.
fr: Une brève description de la formule de sponsoring.

source: The files of the sponsorship package.
fr: Les fichiers du dossier de sponsoring.

source: The symbol of the sponsorship package.
fr: Le symbole de la formule de sponsoring.

source: A description of the sponsor.
fr: Une description du sponsor.

source: The URL of the sponsor if needed.
fr: L'URL du sponsor, si nécessaire.

source: Whether the sponsor is hiring or not.
fr: Indiquer si le sponsor recrute ou non.

source: Hiring URL of the sponsor.
fr: L'URL de recrutement du sponsor.

source: The name of the tag.
fr: Le nom du tag.

source: Our Sponsors
fr: Nos sponsors

source: DjangoCon Africa is made possible by the generous support of our sponsors. We are thankful for their support and encourage you to learn more about them. We're grateful to them all!
fr: DjangoCon Africa est rendu possible grâce au soutien généreux de nos sponsors. Nous sommes reconnaissants de leur soutien et nous vous encourageons à en savoir plus sur eux. Nous leur sommes tous reconnaissants !

source: Account Inactive
fr: Compte Inactif

source: This account is inactive.
fr: Ce compte est inactif.

source: You are receiving this email because you or someone else tried to signup for an account using email address: %(email)s However, an account using that email address already exists. In case you have forgotten about this, please use the password forgotten procedure to recover your account: %(password_reset_url)s
fr: Vous recevez cet e-mail parce que vous ou quelqu'un d'autre a essayé de créer un compte à l'aide l'adresse e-mail suivante: %(email)s Cependant, un compte utilisant cette adresse e-mail existe déjà. Au cas où vous l'auriez oublié, veuillez utiliser la procédure d'oubli du mot de passe pour récupérer votre compte : %(password_reset_url)s

source: Account Already Exists
fr: Le Compte Existe Déjà

source: Hello from %(site_name)s!
fr: Bonjour de la part de %(site_name)s !

source: Thank you for using %(site_name)s! %(site_domain)s
fr: Merci d'utiliser %(site_name)s ! %(site_domain)s

source: You are receiving this mail because the following change was made to your account:
fr: Vous recevez ce courrier parce que la modification suivante a été apportée à votre compte :

source: If you do not recognize this change then please take proper security precautions immediately. The change to your account originates from: - IP address: %(ip)s - Browser: %(user_agent)s - Date: %(timestamp)s
fr: Si vous ne reconnaissez pas ce changement, veuillez prendre immédiatement les mesures de sécurité qui s'imposent. La modification de votre compte provient de : - L'adresse IP : %(ip)s - Navigateur : %(user_agent)s - Date : %(timestamp)s

source: Your email has been confirmed.
fr: Votre courriel a été confirmé.

source: Email Confirmation
fr: Confirmation de l'adresse électronique

source: Please Confirm Your Email Address
fr: Veuillez confirmer votre adresse électronique

source: Your password has been changed.
fr: Votre mot de passe a été modifié.

source: Password Changed
fr: Mot de passe modifié

source: You're receiving this email because you or someone else has requested a password reset for your user account. It can be safely ignored if you did not request a password reset. Click the link below to reset your password.
fr: Vous recevez cet e-mail parce que vous ou quelqu'un d'autre a demandé une réinitialisation du mot de passe de votre compte d'utilisateur. Vous pouvez ignorer ce message si vous n'avez pas demandé la réinitialisation de votre mot de passe. Cliquez sur le lien ci-dessous pour réinitialiser votre mot de passe.

source: In case you forgot, your username is %(username)s.
fr: Au cas où vous l'auriez oublié, votre nom d'utilisateur est %(username)s.

source: Password Reset Email
fr: Courriel de réinitialisation du mot de passe

source: Your password has been reset.
fr: Votre mot de passe a été réinitialisé.

source: Password Reset
fr: Reinitialiser le mot de passe

source: Your password has been set.
fr: Votre mot de passe a été créé

source: Password Set
fr: Configuration mot de passe

source: You are receiving this email because you, or someone else, tried to access an account with email %(email)s. However, we do not have any record of such an account in our database.
fr: Vous recevez cet e-mail car une tentative d'accès à un compte avec l'adresse %(email)s a été effectuée. Cependant, nous n'avons aucun compte enregistré avec cette adresse.

source: This mail can be safely ignored if you did not initiate this action.
fr: Ce message peut être ignoré si vous n'êtes pas à l'origine de cette action.

source: If it was you, you can sign up for an account using the link below.
fr: Si vous êtes à l'origine de cette action, vous pouvez vous inscrire et créer un compte en utilisant le lien ci-dessous.

source: Unknown Account
fr: Compte Inconnu

source: Confirm Email Address
fr: Confirmez l'adresse email

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an email address for user %(user_display)s.
fr: Merci de confirmer que <a href="mailto:%(email)s">%(email)s</a> est bien l'adresse email pour l'utilisateur %(user_display)s.

source: Unable to confirm %(email)s because it is already confirmed by a different account.
fr: %(email)s est déjà utilisé dans un autre compte

source: This email confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new email confirmation request</a>.
fr: Lien de confirmation expiré ou invalide. Veuillez <a href="%(email_url)s"> demander une nouvelle confirmation </a>.

source: Confirmation email sent to %(email)s.
fr: E-mail de Confirmation envoyé à %(email)s.

source: You have confirmed %(email)s.
fr: %(email)s confirmé.

source: Successfully signed in as %(name)s.
fr: Vous êtes bien authentifié en tant que %(name)s.

source: You have signed out.
fr: Vous êtes déconnecté(e).

source: Password successfully changed.
fr: Mot de passe modifié avec succès.

source: Password successfully set.
fr: Mot de passe défini avec succès.

source: Change Password
fr: Changer le mot de passe

source: Forgot Password?
fr: Mot de passe oublier?

source: Set Password
fr: Configurer le mot de passe

source: You are already logged in as %(user_display)s.
fr: Vous êtes déjà connecté en tant que %(user_display)s.

source: Warning:
fr: Attention :

source: You currently do not have any email address set up. You should really add an email address so you can receive notifications, reset your password, etc.
fr: Vous n'avez pas encore d'adresse électronique configurée. Vous devriez ajouter une adresse électronique afin de pouvoir recevoir des notifications, réinitialiser votre mot de passe, etc.

source: Verify Your Email Address
fr: Vérifiez votre adresse électronique

source: This part of the site requires us to verify that you are who you claim to be. For this purpose, we require that you verify ownership of your email address.
fr: Cette partie du site nous oblige à vérifier que vous êtes bien celui que vous prétendez être. À cette effet, nous vous demandons de vérifier la propriété de votre adresse électronique.

source: We have sent an email to you for verification. Please click on the link inside that email. If you do not see the verification email in your main inbox, check your spam folder. Otherwise contact us if you do not receive it within a few minutes.
fr: Nous vous avons envoyé un courriel pour vérification. Veuillez cliquer sur le lien contenu dans cet e-mail. Si vous ne voyez pas l'e-mail de vérification dans votre boîte de réception principale, vérifiez votre dossier de courrier indésirable. Sinon, contactez-nous si vous ne le recevez pas dans les minutes qui suivent.

source: <strong>Note:</strong> you can still <a href="%(email_url)s">change your email address</a>.
fr: <strong>Note:</strong> vous pouvez toujours <a href="%(email_url)s">changer votre adresse e-mail</a>.

source: Code of Conduct
fr: Code de Conduite

source: Everybody who participates at DjangoCon Africa in one way or another is required to conform to this Code of Conduct (CoC). This includes attendees, speakers, sponsors, organisers and volunteers. <br /><br /> We will introduce a Code of Conduct team that will be primarily responsible for handling any incidents at the conference. The CoC applies before and throughout the event (including related activities such as social events, and social media).
fr: Chaque personne prenant part à la conférence DjangoCon Africa est tenue de se conformer à ce Code de Conduite (CdC). Cela inclut les participants, les conférenciers, les sponsors, les organisateurs et les bénévoles. <br /><br /> Nous mettrons en place une équipe chargée du Code de Conduite qui sera principalement responsable de la gestion de tout incident survenant lors de la conférence. Le Code de Conduite s'applique avant et pendant l'événement (y compris les activités connexes telles que les événements sociaux et les réseaux sociaux).

source: Why do we have a Code of Conduct?
fr: Pourquoi disposons-nous d'un Code de Conduite ?

source: Our goals with having this Code of Conduct are:
fr: Les objectifs de ce Code de Conduite sont les suivants :

source: Helping everyone feel safe and included. Many attendees are first timers, or have had poor experiences in other events. We want to set the expectation that harassment and other unpleasant behavior are not acceptable. So that if people do have an unpleasant experience, they know that’s not neither the norm nor acceptable to us as a community.
fr: Aider chacun à se sentir en sécurité et inclus. De nombreux participants viennent pour la première fois ou ont eu de mauvaises expériences lors d'autres événements. Nous voulons faire comprendre que le harcèlement et toute autre forme de comportement inapproprié sont inacceptables. Ainsi, si des gens ont une expérience désagréable, ils savent que ce n'est ni normal ni acceptable pour nous en tant que communauté.

source: Helping to build trust that if an incident is reported, we will not respond with victim blaming, and that we will do a thorough investigation. Even, for example, if the incident concerns someone in a position of power.
fr: Contribuer à instaurer la confiance dans le sens où, si un incident est signalé, nous ne réagirons pas en blâmant la victime et nous mènerons une enquête approfondie. Même si, par exemple, l'incident implique une personne en position de pouvoir.

source: Informing everyone of the expected behavior. We are a diverse community, and having a Code of Conduct makes the expectations of everybody’s behavior explicit and transparent.
fr: Informer chacun du comportement attendu. Nous sommes une communauté diversifiée, et le fait d'avoir un Code de Conduite rend explicites et transparentes les attentes quant au comportement de chacun.

source: Having a framework for report handling. The Code of Conduct is the basis for dealing with a report, assessing whether the CoC was violated, and what action should be taken.
fr: Disposer d'un cadre pour le traitement des plaintes. Le Code de Conduite constitue la base du traitement d'une plainte, de l'évaluation de la violation du CdC et de l'action à mener.

source: Our Code of Conduct
fr: Notre Code de Conduite

source: Be kind and considerate to others. Do not insult or put down other attendees. Behave professionally.
fr: Être aimable et bienveillant vis-à-vis des autres. Ne pas insulter ou rabaisser les autres participants. Se comporter de manière professionnelle.

source: We are dedicated to providing a harassment-free conference experience for everyone, regardless of race, ethnicity, culture, national origin, colour, immigration status, social and economic class, educational level, sex, sexual orientation, gender identity and expression, age, size, family status, political belief, religion, and mental and physical ability.
fr: Nous nous engageons à offrir à tous une expérience de conférence sans risque de harcèlement, indépendamment de la race, de l'ethnie, de la culture, de la nationalité, de la couleur, du statut d'immigrant, de la classe sociale et économique, du niveau d'éducation, du sexe, de l'orientation sexuelle, de l'identité et de l'expression de genre, de l'âge, de la taille, de la situation familiale, des convictions politiques, de la religion et des aptitudes mentales et physiques.

source: We do not tolerate harassment of conference participants in any form. This includes offensive comments related to the categories above, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, violent threats or language, inappropriate physical contact, and unwelcome sexual attention.
fr: Nous ne tolérons aucune forme de harcèlement à l'encontre des participants à la conférence. Cela inclut les commentaires offensants liés aux catégories ci-dessus, l'intimidation délibérée, la traque, le suivi, la prise de photos ou d'enregistrements à caractère harcelant, la perturbation régulière des présentations ou d'autres activités, les menaces ou les propos agressifs, les contacts physiques inappropriés et l'attention sexuelle non désirée.

source: Advocating for, or encouraging, any of the above behavior is also not acceptable.
fr: Encourager ou prôner ces comportements est également inacceptable.

source: Sexual language and imagery are not appropriate for any venue to which the CoC applies.
fr: L'utilisation de langage et d'images à caractère sexuel est interdite dans tout lieu relevant du code de conduite.

source: Don’t publish individual photographs of people without their consent.
fr: Si on veut publier la photo d'une personne. Demander son consentement d'abord.

source: Be careful in the words that you choose. Remember that sexist, racist, and other exclusionary jokes can be offensive and unwelcoming to those around you.
fr: Choisissez vos mots avec soin. N'oubliez pas que les blagues sexistes, racistes et autres blagues d'exclusion peuvent être offensantes et mal accueillies par les personnes qui vous entourent.

source: Excessive swearing and offensive jokes are not appropriate for DjangoCon Africa.
fr: Les injures et les plaisanteries de mauvais goût sont inappropriées à DjangoCon Africa.

source: Where does the Code of Conduct apply?
fr: Où s'applique le Code de Conduite ?

source: This Code of Conduct applies to all conference related spaces. That includes, but is not limited to:
fr: Ce Code de Conduite s'applique à tous les espaces dédiés à la conférence. Cela inclut, mais ne se limite pas à :

source: The conference venue(s)
fr: Le(s) lieu(x) de la conférence

source: The conference hotel(s)
fr: L'hôtel ou les hôtels de la conférence

source: Any conference related social activities
fr: Toute activité sociale associée à la conférence

source: Slack channels, tweets with the conference hashtag, and other online media
fr: Canal Slack, tweets avec le hashtag de la conférence et autres médias en ligne

source: The Code of Conduct does not exclusively apply to events on the conference agenda. For example, if after a scheduled social event you go to a bar with a group of fellow participants, and someone harasses you there, we would still treat that as a CoC violation.
fr: Le code de conduite ne s'applique pas exclusivement aux événements prévus à l'ordre du jour de la conférence. Par exemple, si après un événement social prévu, vous vous rendez dans un bar avec un groupe de participants et que quelqu'un vous y harcèle, nous considérerons qu'il s'agit d'une violation du CdC.

source: What can happen if the CoC is violated?
fr: Que se passe-t-il en cas de violation du Code de Conduite ?

source: In case of a Code of Conduct violation, some of the most common actions organisers may take are:
fr: En cas de violation du code de conduite, les organisateurs peuvent prendre les mesures suivantes :

source: Demanding that a participant stops their behavior.
fr: Exiger qu'un participant mette fin à son comportement.

source: Demanding that a participant prevents further contact with certain other participants.
fr: Exiger d'un participant qu'il n'entre plus en contact avec certains autres participants.

source: Not publishing the video of a conference talk.
fr: Ne pas publier la vidéo d'une présentation à la conférence.

source: Cancelling a conference talk.
fr: Annuler une présentation à la conférence.

source: Removing a participant from the conference, without refund.
fr: Exclure un participant de la conférence, sans remboursement.

source: The action taken is at the discretion of the Code of Conduct team. Participants are expected to comply immediately, and further action may be taken in case a participant does not comply. A record will be kept of all incidents.
fr: Les mesures prises sont laissées à la discrétion de l'équipe chargée du Code de Conduite. Les participants sont tenus d'obtempérer immédiatement et d'autres mesures peuvent être prises en cas de non-respect. Tous les incidents seront consignés dans un registre.

source: Where to report incidents
fr: Où signaler les incidents

source: If a Code of Conduct incident happens to you, or witness it happening to someone else, please contact the CoC team immediately either in person, or by sending an email to
fr: Si vous êtes victime ou témoin d'un incident relevant du Code de Conduite, veuillez contacter immédiatement l'équipe chargée du Code de Conduite, soit en personne, soit en envoyant un courrier électronique à l'adresse suivante

source: In urgent cases, you can also phone us on. <br /> Our Code of Conduct team consists of:
fr: En cas d'urgence, vous pouvez également nous téléphoner au. <br /> Notre équipe chargée du Code de Conduite est composée de :

source: The team members will be introduced in person at the conference. You can approach any of them at any time to discuss an incident or concern. You can also ask any other staff to help you find them at the conference.
fr: Les membres de l'équipe seront présentés en personne lors de la conférence. Vous pouvez vous adresser à n'importe lequel d'entre eux à tout moment pour discuter d'un incident ou d'une préoccupation. Vous pouvez également demander à un autre membre du personnel de vous aider à les trouver lors de la conférence.

source: Guidelines for reporting incidents
fr: Directives pour le signalement d'incidents

source: Please do not feel like you may be a burden to us by reporting incidents. Even if you happen to report multiple incidents during the conference. We rather consider reports an opportunity for us to act: by knowing about an incident, we can act on it, and often prevent it from continuing or repeating. But if we don’t know, we can’t take action.
fr: N'ayez pas l'impression d'être un fardeau pour nous en signalant des incidents. Même si vous en signalez plusieurs au cours de la conférence. Nous considérons plutôt les signalements comme une occasion d'agir : en ayant connaissance d'un incident, nous pouvons agir et souvent empêcher qu'il ne se poursuive ou ne se répète. Mais si nous ne savons pas, nous ne pouvons pas agir.

source: If you are not sure whether the situation was a Code of Conduct violation, or whether it applied to that particular space, we encourage you to still report it. We would much rather have a few extra reports where we decide to take no action, rather than miss a report of an actual violation. We do not look negatively on you if we find the incident is not a violation. And knowing about incidents that are not violations, or happen outside our spaces, can also help us to improve the Code of Conduct or the processes surrounding it.
fr: Si vous n'êtes pas certain que la situation constitue une violation du Code de Conduite ou qu'elle s'applique à cet espace en particulier, nous vous encourageons à la signaler. Nous préférons recevoir quelques rapports supplémentaires pour lesquels nous décidons de ne pas prendre de mesures, plutôt que de manquer une violation réelle. Nous ne vous jugerons pas négativement si nous estimons que l'incident ne constitue pas une violation. Par ailleurs, connaitre les incidents qui ne sont pas une violation ou qui se produisent en dehors de nos espaces, peut aider a améliorer le Code de Conduite ou les processus qui l'entourent.

source: In your report please include, when possible:
fr: Dans votre rapport, veuillez inclure, dans la mesure du possible:

source: Your contact info (so we can get in touch with you)
fr: Vos coordonnées (pour que nous puissions vous contacter)

source: Names (real, nicknames, or pseudonyms) of any individuals involved. If there were other witnesses besides you, please try to include them as well.
fr: Les noms (réels, surnoms ou pseudonymes) de toutes les personnes impliquées. S'il y a eu d'autres témoins que vous, essayez de les inclure également.

source: When and where the incident occurred. Please be as specific as possible.
fr: Quand et où l'incident s'est produit. Soyez aussi précis que possible.

source: Your account of what occurred. If there is a written record (e.g. tweets or slack messages) please include screenshots, or otherwise a link.
fr: Votre récit de ce qui s'est passé. S'il existe une trace écrite (par exemple, des tweets ou des messages Slack), veuillez inclure des captures d'écran ou, à défaut, un lien.

source: Any extra context you believe existed for the incident.
fr: Tout contexte supplémentaire concernant l'incident.

source: If you believe this incident is ongoing.
fr: Si vous pensez que l'incident est en cours.

source: Any other information you believe we should have.
fr: Toute autre information dont vous pensez que nous devrions disposer.

source: If you don’t have some of this information, or not at this time, please still make the report anyways. <br /><br /> If you feel unsafe reporting in person, you may choose someone to represent you. In this case, we’d need their contact information, but we’d ask you to make clear that this person represents you.
fr: Si vous ne disposez pas de certaines de ces informations, ou si vous n'en disposez pas pour l'instant, veuillez tout de même faire votre déclaration. <br /><br /> Si vous ne vous sentez pas en sécurité pour faire votre déclaration en personne, vous pouvez choisir quelqu'un pour vous représenter. Dans ce cas, nous aurons besoin de ses coordonnées, mais nous vous demanderons de préciser que cette personne vous représente.

source: Other assistance
fr: Autre assistance
