Repository: djangocon/2025.djangocon.africa
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: If you are making anything that is useful to Django developers, such as developer tools, SaaS products or hosting platforms, this is the perfect marketing opportunity. Africa is a fresh and ready market; and a booth at our conference will enable to meet new potential customers for your products.
fr: Si vous concevez des produits utiles aux développeurs Django, tels que des outils de développement, des produits SaaS ou des plateformes d'hébergement, c'est l'occasion idéale de faire du marketing. L'Afrique est un marché nouveau et prêt, et un stand à notre conférence vous permettra de rencontrer de nouveaux clients potentiels pour vos produits.

source: DjangoCon Africa will uphold the tradition of existing DjangoCons all over the world of investing in great efforts in being a diverse conference. Africa itself is very diverse with a total of 54 countries made up of many different ethnicities. Only with the help of our sponsors can we be able to bring people from all social backgrounds and different parts of the world together at our very first event.
fr: DjangoCon Africa maintiendra la tradition des DjangoCons existantes dans le monde entier en investissant des efforts considérables pour être une conférence diversifiée. L'Afrique elle-même est un continent très diversifié, composé de 54 pays aux nombreuses ethnies différentes. Ce n'est qu'avec l'aide de nos sponsors que nous pourrons rassembler des personnes de tous les milieux sociaux et de différentes régions du monde lors de notre événement.

source: There is no better place to recruit Django developers than a DjangoCon! DjangoCon Africa is the largest single gathering of Django developers in Africa. Sponsoring the very first DjangoCon Africa will put you directly in front of a fresh candidate pool.
fr: Il n'y a pas de meilleur endroit pour recruter des développeurs Django qu'une DjangoCon ! DjangoCon Africa est le plus grand rassemblement de développeurs Django sur le continent africain. En sponsorisant la deuxième DjangoCon Africa, vous vous positionnerez directement face à un vivier de jeunes talents.

source: If you use Django or related projects to build your software products, sponsoring DjangoCon Africa is a good way to give back to the community and say “thank you” to its members. Any open source community survives on the goodwill of its members and the conference is an important gathering to meet and discuss the future of Django. At the same time, sponsoring allows us to keep ticket prices affordable and even offer financial aid for developers from marginalized groups who could not otherwise join.
fr: Si vous utilisez Django ou des projets connexes pour concevoir vos produits logiciels, soutenir la DjangoCon Africa est un bon moyen de rendre à la communauté ce qu'elle vous a donné et de dire « merci » à ses membres. Toute communauté open source survit grâce à la bonne volonté de ses membres et la conférence est un important rassemblement pour se rencontrer et discuter de l'avenir de Django. En même temps, le sponsoring nous permet de maintenir le prix des billets à un coût abordable et même d'offrir une assistance financière aux développeurs issus de groupes marginalisés qui ne pourraient pas s'inscrire autrement.

source: Your own employees can profit a lot from attending DjangoCon Africa. Not only does the conference provide valuable education in form of talks and workshops that improve their professional talks and technical skills, it is also the best single place to start and build a network within a community of potential future partners.
fr: Vos propres employés peuvent tirer profit d'une participation à la DjangoCon Africa. La conférence offre une formation précieuse sous forme de présentations et d'ateliers qui améliorent leurs compétences techniques et professionnelles, mais c'est aussi le meilleur endroit pour commencer à construire un réseau au sein d'une communauté de futurs partenaires potentiels.

source: Where does your money go to?
fr: Où va votre argent ?

source: Djangocon Africa is run by volunteers on a non-profit basis. All the money we receive will go towards covering the costs of the event and reducing the cost for our attendees. This includes:
fr: La Djangocon Africa est organisée par des bénévoles sur une base non lucrative. Tout l'argent que nous recevons sert à couvrir les coûts de l'événement et à réduire les frais pour les participants. Cela comprend:

source: catering and refreshments
fr: la restauration et les rafraîchissements

source: venue rent
fr: la location de la salle

source: technical services
fr: les services techniques

source: financial assistance for accommodation and travel for attendees and speakers on a low budget.
fr: l'assistance financière pour l'hébergement et les déplacements des participants et des orateurs à faible budget.

source: video recordings for talks
fr: l'enregistrement vidéo des présentations

source: conference merchandise and program booklet
fr: les produits dérivés de la conférence et la brochure du programme

source: basic running expenses
fr: les dépenses de fonctionnement de base

source: Anything left over will be used for supporting future non-profit events.
fr: Tout excédent sera utilisé pour soutenir de futurs événements à but non lucratif.

source: Conference
fr: Conférence

source: Speaking
fr: Présentation

source: Speaking at Djangocon Africa
fr: Intervenir à Djangocon Africa

source: Speaker Resources
fr: Ressources pour les Orateurs

source: Call for Proposals
fr: Appel à Propositions

source: Become a Sponsor
fr: Devenir Sponsor

source: Talk Proposals
fr: Propositions d'Exposés

source: Logout
fr: Déconnexion

source: LogIn
fr: Se connecter

source: Link to Opportunity Grant
fr: Lien vers l'Opportunité de Bourse

source: Whether the button is an open state.
fr: Si le bouton est dans un état ouvert.

source: The date and time when the button should be considered closed.
fr: La date et l'heure auxquelles le bouton doit être considéré comme fermé.

source: The date and time when the Opportunity Grant was created.
fr: La date et l'heure de création de l'opportunité de bourse.

source: The date and time when the Opportunity Grant was updated.
fr: La date et l'heure de la mise à jour de l'opportunité de bourse.

source: Latest News
fr: Dernières Actualités

source: 5 days of inspiration, education and networking at DjangoCon Africa from 25-31 August, 2025 in Arusha, Tanzania.
fr: Rejoignez-nous pour 5 jours d'inspiration, d'éducation et de réseautage à la DjangoCon Africa du 11 au 15 Août 2025 en Tanzanie.

source: Secure a spot
fr: Réserver une place

source: Apply to speak
fr: Postuler pour intervenir

source: Pumped for DjangoCon Africa? Secure a spot now!
fr: Vous êtes impatient de participer à la DjangoCon Africa ? Réservez votre place dès maintenant !

source: Get tickets
fr: Obtenir des billets

source: Our Schedule
fr: Notre Programme

source: Learn more
fr: En savoir plus

source: Purchase a Ticket
fr: Acheter un Billet

source: Welcome to DjangoCon Africa 2025 Ticket Portal!
fr: Bienvenue sur le portail des billets de DjangoCon Africa 2025 !

source: Ready to join us at DjangoCon Africa 2025? Select your ticket type below to secure your spot. Early bird tickets are available for a limited time, so don't miss out on the special rates.
fr: Prêt à nous rejoindre à DjangoCon Africa 2025? Choisissez votre type de billet ci-dessous pour réserver votre place. Les billets à tarif préférentiel sont disponible pour une durée limitée, alors ne ratez pas ces tarifs spéciaux.

source: Purchase via WhatsApp
fr: Acheter par WhatsApp

source: Click the link below to start your ticket purchase process on WhatsApp:
fr: Cliquer sur le lien ci-dessous pour commencer l'achat de votre billet sur WhatsApp

source: Buy Ticket on WhatsApp
fr: Acheter un Billet sur WhatsApp

source: For any questions about WhatsApp purchases, please contact our support team at: <a href="mailto:tickets@djangocon.africa" style="color:">tickets@djangocon.africa</a>
fr: Pour toute question concernant les achats sur WhatsApp, veuillez contacter notre équipe d'assistance à l'adresse: <a href="mailto:tickets@djangocon.africa" style="color:">tickets@djangocon.africa</a>

source: Resources
fr: Ressources

source: News
fr: Actualités

source: Call For Proposals Open
fr: Appel à Propositions Ouvert

source: Call for Sponsors Open
fr: Appel à Sponsors Ouvert

source: Opportunity Grant Open
fr: Demandes de bourses Ouvertes

source: Ticket Sales Open
fr: Debut de le Vente des Billets

source: Opportunity Grants && Call For Proposals close
fr: Fermeture de Bourses et d'Appel à Propositions

source: Talk review start
fr: Début Revue des Propositions

source: Opportunity Grant && Call for Proposal Notifications
fr: Notifications de Bourses et d'Appel à Propositions

source: Django Girls starts
fr: Début de Django Girls

source: Django Girls ends
fr: Fin de Django Girls

source: Conference starts
fr: Début de la Conférence

source: UbuCon starts
fr: Début de UbuCon

source: Conference ends
fr: Fin de la Conférence

source: UbuCon ends
fr: Fin de UbuCon
