Repository: djangocon/2025.djangocon.africa
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: Conference staff will be happy to help participants contact hotel/venue security or local law enforcement, provide escorts, or otherwise assist those experiencing harassment to feel safe for the duration of the conference. However, we will not contact security or law enforcement without your consent, except when not doing so would create significant danger for other participants.
fr: Le personnel de la conférence n'hésitera pas à contacter la sécurité de l'hôtel/du site ou les forces de l'ordre locales, de fournir des escortes ou d'aider d'une autre manière les personnes victimes de harcèlement à se sentir en sécurité pendant toute la durée de la conférence. Toutefois, nous ne contacterons pas la sécurité ou les forces de l'ordre sans votre consentement, sauf si le fait de ne pas le faire crée un danger important pour les autres participants.

source: We value your attendance, and look forward to seeing you at DjangoCon Africa.
fr: Nous apprécions votre présence et nous nous réjouissons de vous voir à la DjangoCon Africa.

source: This Code of Conduct was adapted from
fr: Ce Code de Conduite a été adapté de

source: Code of Conduct written by
fr: Code de conduite rédigé par

source: Join us for 5 days of inspiration, education and networking at DjangoCon Africa from 11 - 15 August, 2025 in
fr: Rejoignez-nous pour 5 jours d'inspiration, d'éducation et de réseautage à la DjangoCon Africa du 11 au 15 août 2025 à

source: First DjangoCon Africa
fr: Première DjangoCon Africa

source: In 2023 we hosted the first ever DjangoCon Africa. DjangoCon Africa took place in Zanzibar, Tanzania 6th-11th November 2023.
fr: En 2023, nous avons accueilli la toute première DjangoCon Africa. DjangoCon Africa s'est déroulée à Zanzibar, en Tanzanie, du 6 au 11 novembre 2023.

source: We had roughly 200 attendees, of whom 103 were women. The attendees represented at least 22 countries from around the world.
fr: Nous avons eu environ 200 participants, dont 103 femmes. Ils représentaient au moins 22 pays du monde entier.

source: We held 26 talks on topics covering programming, society, careers, education, disability, agriculture - the full range of topics you’d expect at a DjangoCon, with the African perspective often at the forefront.
fr: Nous avons animé 26 sessions autour de thèmes tels que la programmation, la société, les carrières, l'éducation, le handicap, l'agriculture, soit toute la gamme de sujets auxquels on peut s'attendre lors d'une DjangoCon, avec la perspective africaine étant au premier plan.

source: Read the 2023 report
fr: Lire le rapport de 2023

source: What will be happening at DjangoCon Africa
fr: Les grandes tendances de la DjangoCon Africa

source: Talks
fr: Présentations

source: Three days of talks, on programming, technology, careers, society and business, with speakers from across the world.
fr: Trois jours de présentations sur la programmation, la technologie, les carrières, la société et les affaires, avec des orateurs du monde entier.

source: Workshops and tutorials
fr: Ateliers et tutoriels

source: Hands-on training and learning sessions, led by experts in the field. Details to be published soon.
fr: Sessions de formation et d'apprentissage pratiques, dirigées par des experts du domaine. Les détails seront publiés bientôt.

source: Work together on code, and contribute to major projects - including Django itself.
fr: Collaborer sur le code et contribuer à des projets majeurs, y compris Django lui-même.

source: A training workshop aimed at women, providing an introduction to web application development. Tens of thousands of women across the world have had their introduction to Django through this hugely successful programme.
fr: Un atelier de formation destiné aux femmes, offrant une introduction au développement d'applications web. Des dizaines de milliers de femmes à travers le monde ont été initiées à Django grâce à ce programme qui connaît un grand succès.

source: Discovery
fr: Découverte

source: DjangoCon Africa is an opportunity to discover places and people as well as technology. It will bring together participants from across Africa and the rest of the world, for mutual understanding of contexts, challenges and opportunities.
fr: DjangoCon Africa est l'occasion de découvrir des lieux et des personnes ainsi que des technologies. Elle réunira des participants de toute l'Afrique et du monde entier, pour une compréhension mutuelle des contextes, des défis et des opportunités.

source: DjangoCon Africa is made possible by the generous sponsorships of various teams and organisations around the world.
fr: DjangoCon Africa est rendu possible grâce aux généreux soutiens de diverses équipes et organisations à travers le monde.

source: Sponsor us
fr: Nous Sponsoriser

source: Introducing DjangoCon Africa 🌍 2025 🎉
fr: Découvrez DjangoCon Africa 🌍 2025 🎉

source: The African Django community is excited to announce the second DjangoCon Africa event, taking...
fr: La communauté africaine de Django est heureuse d'annoncer la deuxième édition de DjangoCon Africa, qui...

source: 23 Jan • By Team
fr: 23 Jan • Par Équipe

source: By Team • 23 Jan. 2025
fr: Par Équipe • 23 Jan. 2025

source: The African Django community is excited to announce the second DjangoCon Africa event, taking place this year in Arusha, Tanzania, from 11th - 15th August 2025.
fr: La communauté Africaine Django est ravie d'annoncer la deuxième édition de DjangoCon Africa, qui se tiendra cette année à Arusha, en Tanzanie, du 11 au 15 août 2025.

source: About DjangoCon Africa
fr: À propos de DjangoCon Africa

source: DjangoCon Africa will include 3 days of single-track talks, 2 days of workshops and sprints, and one day of touring for international visitors.
fr: DjangoCon Africa propose 3 jours de présentations individuelles, et 2 jours d'ateliers et de sprints.

source: The event will also include a Django Girls workshop to be held the weekend before DjangoCon Africa. To make the conference as inclusive as possible, the event will offer financial aid to members of under-represented communities in software to ensure they can also attend.
fr: L'événement offrira également un atelier DjangoGirls qui se tiendra le week-end précédant la DjangoCon Africa. Afin de rendre la conférence aussi inclusive que possible, l'événement offrira une aide financière aux membres des communautés sous-représentées dans le domaine des logiciels afin de s'assurer qu'ils puissent également y participer.

source: The CFP, which is open to all, will also be announced as soon as the month of June.
fr: Le CFP, qui est ouvert à tous, sera également annoncé dès le mois de Février.

source: Sponsorship
fr: Sponsoring

source: The success of DjangoCon Africa lies hugely in the sponsorship of organizations and individuals within the Python/Django community. We are appealing to organizations and individuals to help us make DjangoCon Africa possible by sponsoring the event. If you are interested in sponsoring DjangoCon Africa 2025, please contact the team at sponsors@djangocon.africa.
fr: Le succès de DjangoCon Africa repose en grande partie sur le sponsoring d'organisations et d'individus au sein de la communauté Python/Django. Nous faisons appel aux organisations et aux individus pour nous aider à rendre DjangoCon Africa possible en sponsorisant l'événement. Si vous êtes intéressé par le sponsoring de DjangoCon Africa 2025, veuillez contacter l'équipe à l'adresse sponsors@djangocon.africa.

source: About Tanzania
fr: À propos de la Tanzanie

source: Tanzania is a country in East Africa widely known for its vast wilderness areas which include the Serengeti National Park and the Kilimanjaro National Park, home to Africa’s highest mountain, Kilimanjaro. Its offshore islands are Zanzibar, which has Arabic influences, and Mafia which is a marine park home to whale sharks and coral reefs.
fr: La Tanzanie est un pays d'Afrique de l'Est largement connu pour ses vastes étendues sauvages, dont le Parc National du Serengeti et le Parc National du Kilimandjaro, où se trouve la plus haute montagne d'Afrique, le Kilimandjaro. Ses îles au large sont Zanzibar, qui a des origines arabes, et Mafia, qui est un parc marin abritant des requins, baleines et des récifs coralliens.

source: Arusha is the home of Kilimanjaro National Park. Arusha is very accessible, with two airports, Arusha Municipality Airport for domestic flights and Kilimanjaro International Airport. For international travellers, it is best and cheaper to book direct flight to Arusha, which will land at Kilimanjaro International Airport.
fr: Arusha abrite le parc national du Kilimandjaro. Arusha est très accessible, avec deux aéroports : l'Aéroport de la Municipalité d'Arusha pour les vols domestiques et l'Aéroport International du Kilimandjaro. Pour les voyageurs internationaux, il est préférable et plus économique de réserver un vol direct pour Arusha, qui atterrira à l'Aéroport International du Kilimandjaro.

source: Opportunity Grants
fr: Bourses de soutien

source: DjangoCon Africa opportunity grants are now open until
fr: Les bourses de bourses pour la DjangoCon Africa sont désormais ouvertes jusqu'au

source: Our opportunity grant application window is now closed.
fr: Notre fenêtre de demande de bourses est maintenant fermée.

source: If you have any questions, feel free to reach out to the opportunity grants team at
fr: Si vous avez des questions, n'hésitez pas à contacter l'équipe chargée des bourses à l'adresse suivante

source: DjangoCon Africa 2025 offers grants to attendees and speakers so that those who might otherwise not be able to attend won’t hesitate to participate. Some expenses for the conference attendance (which can include travel, hotel, registration, etc.) will be covered for opportunity grant recipients. We will reimburse grant recipients on the first day of the conference.
fr: DjangoCon Africa 2025 offre des bourses aux participants et aux orateurs afin que ceux qui ne pourraient pas assister à la conférence n'hésitent pas à y participer. Certaines dépenses liées à la participation à la conférence (voyage, hôtel, inscription, etc.) seront couvertes pour les bénéficiaires d'une bourse de soutien. Les bénéficiaires seront remboursés le premier jour de la conférence.

source: We actively encourage people to apply for an opportunity grant. While we wish we could give grants to everyone who applies, we do not have the funds to do that. Our goal is to maximize the impact our grant program has, within the limited funds we have.
fr: Nous encourageons vivement les gens à soumettre une demande de bourse de soutien. Nous aimerions pouvoir octroyer des bourses à toutes les personnes qui en font la demande, mais nous ne disposons pas des fonds nécessaires pour le faire. Notre objectif est de maximiser l'impact de notre programme de soutien, dans la limite des fonds dont nous disposons.

source: We try to do this in a number of ways:
fr: Nous nous efforçons d'y parvenir de différentes manières :

source: Conferences are a meeting place for developers from all around the globe. Therefore, the selection process is designed to benefit people who make a difference, particularly speakers and tutorial presenters.
fr: Les conférences sont un lieu de rencontre pour les développeurs du monde entier. Par conséquent, le processus de sélection est conçu pour bénéficier aux personnes qui font la différence, en particulier les orateurs et les présentateurs de tutoriels.

source: Additionally, the selection process attempts to promote a more diverse DjangoCon Africa. While encouraging diversity takes many forms, we’re happy to use the opportunity grant program as a very direct method of supporting diversity within the Django community. In particular, our grant program prioritises people from underrepresented or marginalised groups in tech, as these people are more likely to experience hardships and difficulties travelling to our events and participating in our community.
fr: De plus, le processus de sélection vise à promouvoir une plus grande diversité au sein de la DjangoCon Africa. Bien que la promotion de la diversité prenne de nombreuses formes, nous sommes heureux d'utiliser le programme de bourses comme moyen direct de promouvoir la diversité au sein de la communauté Django. En outre, notre programme de bourses privilégie les personnes issues de groupes sous-représentés ou marginalisés dans le domaine de la technologie, car ces personnes sont plus susceptibles d'éprouver des difficultés à se rendre à nos événements et à participer à notre communauté.

source: Our program prioritises speakers first, and then anyone who is part of an underrepresented or marginalised group in tech. These groups include, but are not limited to:
fr: Notre programme priorise d'abord les orateurs, puis toute personne faisant partie d'un groupe sous-représenté ou marginalisé dans le domaine de la technologie. Ces groupes comprennent, sans s'y limiter:

source: women and other gender minorities of all expressions and identities; e.g. transgender and non-binary people
fr: les femmes et les autres minorités de genre de toutes expressions et identités, par exemple les personnes transgenres et non binaires

source: people of colour
fr: les personnes de couleur

source: sexuality minorities, including asexual people
fr: les minorités sexuelles, y compris les personnes asexuelles

source: people with disabilities, both visible and invisible
fr: les personnes en situation de handicap, visible ou invisible

source: neurodivergent people
fr: les personnes neurodivergentes

source: people with chronic illnesses or diseases
fr: les personnes souffrant de maladies chroniques

source: religious and ethnic minorities
fr: les minorités religieuses et ethniques

source: age minorities (under ~21, over ~60)
fr: les minorités d'âge (moins de 21 ans, plus de 60 ans)

source: people experiencing poverty
fr: les personnes en situation de pauvreté

source: homeless and home/food insecure people
fr: les sans-abri et les personnes en situation d'insécurité alimentaire

source: caregivers of children or other dependents
fr: les personnes qui s'occupent d'enfants ou d'autres personnes dépendantes

source: people who have experienced trauma and its aftermath (PTSD, anxiety, etc)
fr: les personnes ayant subi un traumatisme et ses conséquences (SSPT, anxiété, etc.)

source: people living with or recovering from substance abuse
fr: les personnes souffrant de toxicomanie ou en voie de guérison

source: The closing date for grant applications will be the same as the call for papers. If you would like to submit to the CFP and need a grant if you are selected, please ensure you fill in both the CFP form and the opportunity grant application form.
fr: La date limite de dépôt des demandes de bourses est la même que celle de l'appel à proposition. Si vous souhaitez postuler à l'appel à propositions et aurez besoin d'une bourse en cas de sélection, veillez à remplir à la fois le formulaire d'appel à propositions et le formulaire de demande de bourse.

source: If you are an accepted speaker, and you don’t need a grant because your employer is funding your conference costs, we can recognise your employer for this. For now we’re planning to get their logo in the programme, next to your talk, and a post on the job board. This is opt-in. With this, we hope to make it a bit easier for you to convince your employer to contribute towards your conference costs as a speaker.
fr: Si votre proposition d'intervention est retenue et que vous n'avez pas besoin d'une bourse parce que votre employeur finance les coûts de votre participation à la conférence, nous pouvons honorer votre employeur pour cette raison. Pour l'instant, nous prévoyons de faire figurer son logo dans le programme, à côté de votre intervention, et de l'afficher sur le tableau des emplois. Il s'agit d'une démarche volontaire. Nous espérons ainsi qu'il vous sera un peu plus facile de convaincre votre employeur de contribuer à vos frais de participation à la conférence en tant qu'orateur.

source: Lastly, we know that for some people it can be challenging to feel like it’s okay for you to apply. That’s why we want to stress:
fr: Enfin, nous savons que pour certaines personnes, il peut être difficile de postuler en toute confiance. C'est pourquoi nous tenons à insister sur ce point:

source: Have you already attended a conference in the past? That’s ok.
fr: Avez-vous déjà participé à une conférence dans le passé ? Cela ne pose pas de problème.

source: Already received a grant in the past? Still ok.
fr: Vous avez déjà reçu une aide financière dans le passé ? C'est toujours OK.

source: Don’t have much experience with Django? That’s ok, too.
fr: Vous n'avez pas beaucoup d'expérience avec Django ? Ce n'est pas grave non plus.

source: Don’t want to take money away from someone else? Really, it’s ok, everyone says that!
fr: Vous ne voulez pas prendre l'argent de quelqu'un d'autre ? Vraiment, ce n'est pas grave, tout le monde le dit !

source: Don’t feel like you deserve this? That’s also ok: you do.
fr: Vous n'avez pas l'impression de le mériter ? Ce n'est pas grave non plus : vous le méritez.

source: Apply
fr: Postuler

source: Closed
fr: Fermé

source: Speaker’s Resources
fr: Ressources pour les orateurs

source: This page is based on the DjangoCon US Speaker Resource page.
fr: Cette page est inspirée de la page de ressources pour orateurs DjangoCon US.

source: Writing a great proposal
fr: Rédiger une bonne proposition

source: Make sure the title of your proposal is attention grabbing. Conferences typically need to review a lot of talk proposals, so you want to make sure yours looks interesting.
fr: Veillez à ce que le titre de votre proposition soit captivant. Les conférences doivent généralement évaluer un grand nombre de propositions de présentations, vous devez donc veiller à ce que la vôtre soit suffisamment originale.

source: Try reading your proposal aloud - it should sound like normal human speech. If it leaves you breathless then you probably need some punctuation.
fr: Essayez de lire votre proposition à haute voix - elle doit ressembler à un discours humain normal. Si elle vous laisse sans voix, vous avez probablement besoin d'un peu de ponctuation.

source: Your proposal should not look like a wall of text.
fr: Votre proposition ne doit pas être un long texte.

source: Make use of the “notes” section of the talk submission form. You can use this to leave messages for the talk reviewers. Eg: you might want to say something like: “I have submitted a few proposals, but this is the one I am most interested in talking about”, “I’m not sure about the title, here are some alternative titles that might work.” or “Please connect me with a speaker mentor”.
fr: Utilisez la section « notes » du formulaire de soumission de présentation. Vous pouvez l'utiliser pour laisser des messages aux évaluateurs de l'exposé. Par exemple : vous pouvez dire quelque chose comme: ”J'ai soumis plusieurs propositions, mais c'est celle-ci qui m'intéresse le plus “, ”Je ne suis pas sûr du titre, voici quelques titres alternatifs qui pourraient fonctionner “ ou ” Veuillez me mettre en contact avec un orateur mentor”.

source: If you have multiple ideas then feel free to make multiple proposals. You can let the conference organizers pick which one seems most appropriate.
fr: Si vous avez plusieurs idées, n'hésitez pas à soumettre plusieurs propositions. Vous pouvez laisser les organisateurs de la conférence choisir celle qui leur semble la plus appropriée.

source: Don’t try to be extra fancy and add in big words that are unnecessary. The point of an abstract is to communicate an idea, so you should focus on clear communication. Take a look at this.
fr: N'essayez pas d'être trop fantaisiste et d'ajouter de gros mots qui ne sont pas nécessaires. Le but d'un résumé est de communiquer une idée, vous devez donc vous concentrer sur une communication claire. Jetez un coup d'œil à ce qui suit.

source: Making an awesome presentation
fr: Faire une présentation géniale

source: Minimal slides are best — avoid walls of text and long lists of bullets.
fr: Des diapositives minimales sont préférables — évitez les longs textes et les longues listes à puces.

source: Light background with dark text is easiest to read; be mindful that the projection screen is white. Choose fonts with adequate spacing between letters, and avoid thin or cursive fonts.
fr: Un fond clair avec un texte foncé est plus facile à lire ; n'oubliez pas que l'écran de projection est blanc. Choisissez des polices de caractères avec un espacement suffisant entre les lettres, et évitez les polices fines ou cursives.

source: If your talk requires live coding or using the terminal, make sure your editor or terminal settings are legible. Dark text on a light background (high contrast) with a large font is best.
fr: Si votre exposé nécessite un codage en direct ou l'utilisation d'un terminal, assurez-vous que les paramètres de votre éditeur ou de votre terminal sont lisibles. Il est préférable d'utiliser un texte foncé sur un fond clair (contraste élevé) avec une police de grande taille.

source: Images, memes, and GIFs should be appropriate for a professional audience.
fr: Les images, les mèmes et les GIF doivent être adaptés à un public professionnel.

source: Avoid or limit flashing videos or animated GIFs, as these may have negative effects for people with seizure disorders, migraines, or ADD/ADHD.
fr: Évitez ou limitez les vidéos clignotantes ou les GIF animés, car ils peuvent avoir des effets négatifs sur les personnes souffrant de troubles épileptiques, de migraines ou de troubles déficitaires de l'attention.

source: At the conference
fr: Lors de la conférence

source: Please be in your presentation room at least 15 minutes before your talk in order to set up and meet your session chair.
fr: Veuillez vous rendre dans votre salle de présentation au moins 15 minutes avant votre intervention afin de vous installer et de rencontrer votre coordinateur de session.

source: Remember to bring your laptop and charger, and any display adapters you might need.
fr: N'oubliez pas d'apporter votre ordinateur portable et son chargeur, ainsi que tout adaptateur d'écran dont vous pourriez avoir besoin.

source: Bring your presentation on a usb stick just in case something goes horribly wrong.
fr: Apportez votre présentation sur une clé USB, au cas où quelque chose tournerait mal.

source: There will be a Quiet Room available on conference days.
fr: Une salle de repos sera disponible les jours de conférence.

source: We may ask you to draft your slides as much as 3 weeks ahead of the conference. We won’t share the slides with anyone outside of the conference organizing team.
fr: Nous pouvons vous demander de rédiger vos diapositives jusqu'à trois semaines avant la conférence. Nous ne partagerons pas les diapositives avec d'autres personnes que l'équipe organisatrice de la conférence.

source: Public speaking
fr: Prise de parole en public

source: A lot of people find public speaking very stressful! Here are a few things that might help:
fr: Pour beaucoup de gens, la prise de parole en public est très stressante ! Voici quelques conseils qui pourraient vous aider :

source: Our community is warm and welcoming, the fact that you are putting effort into contributing is something everyone will appreciate.
fr: Notre communauté est chaleureuse et accueillante, et le fait que vous vous efforciez d'y contribuer est très apprécié de tous.
