Repository: djangocon/2025.djangocon.africa
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: It is normal to stumble from time to time, if you trip over your words then be willing to laugh at yourself and the audience will like you more. Or if you can’t laugh at yourself, just pause for a moment, take a breath or a sip of water and keep going. The audience can wait for a few seconds while you gather your thoughts, it’s ok.
fr: Il est normal de balbutier de temps en temps. Si vous balbutiez vos mots, acceptez de rire de vous-même et le public vous appréciera davantage. Si vous ne pouvez pas rire de vous-même, arrêtez-vous un instant, respirez ou buvez une gorgée d'eau, puis continuez. Le public peut attendre quelques secondes pendant que vous reprenez vos esprits, ce n'est pas grave.

source: If you are prone to anxiety then make a point of practicing your talk in front of an audience ahead of time - your friends, family and colleagues can be very useful here.
fr: Si vous êtes sujet à l'anxiété, il vous sera très utile de vous entraîner à l'avance devant un public - vos amis, votre famille et vos collègues peuvent être très utiles à cet égard.

source: Practicing your talk
fr: Entraînez vous à votre présentation

source: Some people write out a script and then memorize that. Some people are expert freestylers. Both approaches work well, but both need serious preparation.
fr: Certaines personnes écrivent un scénario et l'apprennent par cœur. D'autres sont des experts en freestyle. Les deux approches fonctionnent bien, mais elles nécessitent toutes deux une préparation sérieuse.

source: If you write and memorize your script:
fr: Si vous décidez d'écriver et de mémoriser votre scénario:

source: Realize that memorizing a 30 minute talk is going to take a lot of time
fr: Sachez que la mémorisation d'une présentation de 30 minutes prendra beaucoup de temps

source: If you need cue cards or speaker notes then keep them brief - if you just stare down at your notes that would be bad. Practice looking up and away from your notes.
fr: Si vous avez besoin de cartes de repérage ou de notes d'orateur, soyez bref - si vous vous contentez de regarder vos notes, ce n'est pas bon signe. Entraînez-vous à lever les yeux et à vous éloigner de vos notes.

source: Practice talking through your slides over and over until you don’t stumble.
fr: Entraînez-vous à présenter vos diapositives encore et encore jusqu'à ce que vous ne balbutiez plus.

source: This method might sound easier, but you probably need to know about 30%% more about your topic if you want to freestyle effectively.
fr: Cette méthode peut sembler plus facile, mais vous devez probablement en savoir 30 % de plus sur votre sujet si vous voulez faire du freestyle de manière efficace.

source: Always:
fr: Toujours:

source: Make sure you use a timer while practicing.
fr: Veillez à utiliser un minuteur lorsque vous vous entraînez.

source: Audience Questions
fr: Questions de l'auditoire

source: For a lot of people, this can be the scariest part!
fr: Pour beaucoup de gens, c'est la partie la plus effrayante !

source: If someone asks you a question then feel free to take a moment to think before answering.
fr: Si quelqu'un vous pose une question, n'hésitez pas à prendre un moment de réflexion avant de répondre.

source: If you aren’t sure what the question means then you can ask for clarity or try to paraphrase the question.
fr: Si vous n'êtes pas sûr du sens de la question, vous pouvez demander des éclaircissements ou essayer de paraphraser la question.

source: Once you have attempted to answer the question you can ask “Does that answer your question?”
fr: Une fois que vous avez tenté de répondre à la question, vous pouvez demander “Est-ce que cela répond à votre question ?”

source: If you don’t know the answer to a question then be willing to say “I don’t know”. It’s really ok to not have perfect knowledge. Don’t pretend to know things you don’t and don’t try to distract people from the main question, just be honest about what you know.
fr: Si vous ne connaissez pas la réponse à une question, osez dire “Je ne sais pas”. Il n'y a pas de mal à ne pas avoir une connaissance parfaite. Ne prétendez pas savoir des choses que vous ne savez pas et n'essayez pas de détourner l'attention des gens de la question principale, soyez simplement honnête sur ce que vous savez.

source: Additional Resources
fr: Resources Supplémentaires

source: We understand how it can feel to be a first-time speaker if this is your first time. That’s why we’ve provided links to valuable resources to support you, whether you’re new to speaking or fully experienced, a little extra help never hurts!
fr: Nous comprenons ce que peut ressentir un orateur novice si c'est la première fois qu'il s'exprime. C'est pourquoi nous vous proposons des liens vers des ressources précieuses pour vous aider. Que vous soyez novice ou expérimenté, un peu d'aide supplémentaire ne fait jamais de mal!

source: Write a Conference Abstract
fr: Rédiger un résumé de conférence

source: Public speaking hack for Engaging Presentation
fr: Conseils de prise de parole en public pour une présentation attrayante

source: How I prepare Conference Talks
fr: Comment je prépare mes exposés de conférence

source: Pro Tips for Conference talks
fr: Conseils de pro pour les exposés de conférence

source: Ultimate Guide to Memorable Tech Talks
fr: Guide ultime pour des exposés techniques mémorables

source: Conference Speaking
fr: Prise de parole lors d'une conférence

source: Speaking at DjangoCon Africa
fr: Intervenir à Djangocon Africa

source: Welcome Back to DjangoCon Africa 2025, we are very much excited just as you are!
fr: Bienvenue à DjangoCon Africa 2025, nous sommes tout aussi impatients que vous !

source: To get started, do well to check Proposal guidelines where you will find the steps and guidelines to submit your proposal. Keep in mind that there is a limit of 5 proposal submissions per person.
fr: Pour commencer, consultez les directives relatives aux propositions, où vous trouverez les étapes et les instructions à suivre pour soumettre votre proposition. Gardez à l'esprit qu'il y a une limite de 5 propositions par personne.

source: Why Speak at DjangoCon Africa
fr: Pourquoi intervenir à DjangoCon Africa

source: Share new tools, resources, experiences, practices, and ideas with the Django community and beyond.
fr: Partager de nouveaux outils, ressources, expériences, pratiques et idées avec la communauté Django et au-delà.

source: Connect with other Django professionals, expand your network, and build relationships that can benefit your career and personal growth.
fr: Entrez en contact avec d'autres professionnels de Django, élargissez votre réseau et construisez des relations qui peuvent être bénéfiques pour votre carrière et votre développement personnel.

source: Your talk will be professionally recorded and made available on our official YouTube channel for a global audience to access and learn from. (optional)
fr: Votre exposé sera enregistré de manière professionnelle et mis à disposition sur notre chaîne officielle YouTube pour qu'un large public puisse y accéder et en tirer des enseignements. (optionnel)

source: A professional photographer will be present to capture high-quality images of your talk, providing a lasting visual record of your presentation. (Optional)
fr: Un photographe professionnel sera présent pour capturer des images de haute qualité de votre conférence, fournissant un enregistrement visuel durable de votre présentation. (optionnel)

source: Reach a wide audience and share your insights, experiences, and discoveries with the Django community and beyond.
fr: Touchez un large public et partagez vos idées, vos expériences et vos découvertes avec la communauté Django et au-delà.

source: Give back to Django Community.
fr: Rendre Service à la Communauté Django.

source: Selection Process
fr: Processus de Sélection

source: Reviewing submissions for DjangoCon Africa can be a challenging task, with many excellent talks and tutorials vying for a limited number of slots. To ensure transparency and fairness, we're committed to making our selection process clear to all submitters and attendees. Our main approach is community driven and it involves a team of volunteers and organizers who will review submissions anonymously and collectively decide which ones to feature.
fr: L'examen des candidatures pour la DjangoCon Africa peut s'avérer une tâche difficile, de nombreuses conférences et tutoriels excellents se disputant un nombre limité de places. Pour garantir la transparence et l'équité, nous nous engageons à rendre notre processus de sélection clair pour tous les candidats et participants. Notre approche principale est axée sur la communauté et implique une équipe de bénévoles et d'organisateurs qui examineront les propositions de manière anonyme et décideront collectivement de celles qui seront présentées.

source: Also we will be sharing our guidelines and reviewing process, we aim to provide a better understanding of what attendees can expect from the conference and why certain talks are selected. Additionally, we may prioritize speakers from underrepresented or marginalized groups to amplify the conference's social impact.
fr: Nous partagerons également nos critères et notre processus d'évaluation, afin de permettre aux participants de mieux comprendre ce qu'ils peuvent attendre de la conférence et les raisons pour lesquelles certaines présentations sont sélectionnées. En outre, il se peut que nous donnions la priorité à des orateurs issus de groupes sous-représentés ou marginalisés afin d'amplifier l'impact social de la conférence.

source: We'll document our selection process on this website and announce updates via our social media channels, including <a href="https://twitter.com/djcafrica">Twitter/X</a>, <a href="https://linkedin.com/company/djcafrica">LinkedIn</a>, <a href="https://instagram.com/djcafrica">Instagram</a>, <a href="https://facebook.com/djcafrica">Facebook</a>, <a href="https://fosstodon.org/@djangoconafrica/111065411415401242">Mastodon</a>, <a href="https://bsky.app/profile/djcafrica.bsky.social">Bluesky</a>.
fr: Nous documenterons notre processus de sélection sur ce site web et annoncerons les mises à jour via nos canaux de médias sociaux, notamment <a href="https://twitter.com/djcafrica">Twitter/X</a>, <a href="https://linkedin.com/company/djcafrica">LinkedIn</a>, <a href="https://instagram.com/djcafrica">Instagram</a>, <a href="https://facebook.com/djcafrica">Facebook</a>, <a href="https://fosstodon.org/@djangoconafrica/111065411415401242">Mastodon</a>, <a href="https://bsky.app/profile/djcafrica.bsky.social">Bluesky</a>.

source: Presentation Types
fr: Types de présentation

source: The following are the presentation types that will be accepted in Django Africa Conference 2025
fr: Vous trouverez ci-dessous les types de présentation qui seront acceptés lors à la DjangoCon Africa 2025

source: Talk
fr: Présentation

source: Length: 20 - 45mins
fr: Durée : 20 à 45 minutes

source: We're seeking innovative and captivating talks that cater to the diverse interests of our attendees. While Django expertise is a plus, we're also interested in talks that explore broader themes, such as community, web development, user experience, Education, Open Source and more.
fr: Nous sommes à la recherche de présentations innovantes et captivantes qui répondent aux divers intérêts de nos participants. Bien que l'expertise en Django soit un atout, nous sommes également intéressés par des présentations qui explorent des thèmes plus larges, tels que la communauté, le développement web, l'expérience utilisateur, l'éducation, l'Open Source et bien plus encore.

source: No Worries if you're a first time speaker - we're excited to provide a platform for you to share your ideas and kickstart your speaking journey!
fr: Ne vous inquiétez pas si vous êtes un orateur novice - nous sommes ravis de vous fournir une plateforme pour partager vos idées et démarrer votre carrière d'orateur !

source: Workshop and Tutorials
fr: Ateliers et tutoriels

source: Length: 1.5 - 2hrs
fr: Durée : 1,5 - 2 heures

source: This year we are open to any topic as long as it will develop or improve the experiences and knowledge of our attendee’s.
fr: Cette année, nous sommes ouverts à tous les sujets, tant qu'ils permettent de développer ou d'améliorer les expériences et les connaissances de nos participants.

source: Workshop and Tutorials can be targeted at any experience level, just be sure to indicate clearly what you expect your students to already know or have experience with in your proposal!
fr: Les ateliers et tutoriels peuvent s'adresser à tous les niveaux d'expérience. Assurez-vous simplement d'indiquer clairement dans votre proposition ce que vous pensez que vos étudiants savent déjà ou ont déjà de l'expérience!

source: Lightning Talks
fr: Présentations Courtes

source: Length: 5 - 10mins
fr: Durée : 5 à 10 minutes

source: Not ready for a full talk or tutorial?
fr: Vous n'êtes pas prêt pour une présentation complète ou un tutoriel ?

source: Want to take the leap and give your first conference talk?
fr: Vous voulez vous lancer et faire votre première présentation lors d'une conférence?

source: Our lightning talks are the perfect opportunity! These short, 5-minute talks (with or without slides) are all about sharing your ideas and experiences with the community. Don't be nervous or shy - remember, it's just 5 minutes! We'll have a dedicated lightning talk slot at the end of each day during the conference. Sign-ups will take place during the event, so be sure to mark your calendar and join us!
fr: Nos présentations éclair sont l'occasion idéale ! Ces courtes présentations de 5 minutes (avec ou sans diapositives) sont l'occasion de partager vos idées et vos expériences avec la communauté. Ne soyez pas nerveux ou timide - rappelez-vous, ce ne sont que 5 minutes ! Un créneau dédié aux exposés éclair est prévu à la fin de chaque journée de la conférence. Les inscriptions se feront sur place, alors n'oubliez pas de noter la date dans votre calendrier et de nous rejoindre !

source: Proposal Guidelines
fr: Guide de soumission d'une proposition

source: We will appreciate it more, if you Submit your talk in time.
fr: Nous vous serions reconnaissants de bien vouloir soumettre proposition dans les délais impartis.

source: All talks will be in English.
fr: Tous les exposés seront présentés en Anglais.

source: Read, understand, and agree to our Code of Conduct. As a speaker, your talk and your slides will need to follow our Code of Conduct – if you are not sure what that means, or have some issue you are not sure about, just ask us or email hello@djangocon.africa.
fr: Lisez, comprenez et adhérez à notre Code de Conduite. En tant qu'orateur, votre exposé et vos diapositives devront être conformes à notre Code de Conduite - si vous n'êtes pas sûr de ce que cela signifie, ou si vous avez des doutes, demandez-nous ou envoyez-nous un courriel à l'adresse hello@djangocon.africa.

source: Make sure you spend some time and effort on your proposal. Typos, lack of formatting, and half finished sentences are unnecessary and make your proposal hard to be taken seriously. (Ask a mentor, Check the links in our speakers resources, or a friend to help if this is difficult for you.)
fr: Prenez le temps et le soin de bien préparer votre proposition. Les fautes de frappe, le manque de mise en forme et les phrases inachevées donnent une mauvaise impression et rendent difficile la prise en considération de votre proposition. (Demandez l'aide d'un mentor, consultez les liens dans nos ressources pour les orateurs, ou encore celle d'un ami si cela vous semble difficile.)

source: Don't overdo it – two or three paragraphs are plenty of space to give us an idea of your talk, we don't require an entire thesis.
fr: N'en faites pas de trop - deux ou trois paragraphes suffisent amplement pour nous donner une idée de votre exposé, nous n'avons pas besoin d'une thèse entière.

source: Original content: Since we have little space and lots of submissions, we prefer original content. If your talk is so awesome that you want to give it in multiple places, we'd ask you to consider putting a new spin on it, if at all possible.
fr: Un contenu original : Étant donné que nous disposons de peu de place et que nous recevons beaucoup de propositions, nous préférons un contenu original. Si votre exposé est tellement génial que vous souhaitez le présenter à plusieurs endroits, nous vous demandons d'envisager de lui donner une nouvelle tournure, dans la mesure du possible.

source: Please do well to minimise the use of AI or other technological assistance as much as possible.
fr: Nous vous invitons à limiter autant que possible le recours à l'IA ou à d'autres formes d'assistance technologique.

source: Suggested Topics
fr: Thèmes suggérés

source: Django internals and challenges in modern web development.
fr: Django internals et les défis du développement web moderne.

source: Wild ideas, clever hacks, surprising or cool use cases.
fr: Des idées folles, des trucs astucieux, des cas d'utilisation surprenants ou géniaux.

source: Improving Django and Python developers’ lives.
fr: Améliorer la vie des développeurs Django et Python.

source: Pushing Django to its limits.
fr: Pousser Django à ses limites.

source: The Django and Python community, culture, history, past, present & future, the why, the who and the what of it all.
fr: La communauté Django et Python, sa culture, son histoire, son passé, son présent et son futur, le pourquoi, le qui et le quoi de tout cela.

source: Security
fr: Sécurité

source: Emerging technologies and industries – AI, Blockchain, Open Source etc.
fr: Technologies et industries émergentes - IA, Blockchain, Open Source, etc.

source: Diversity, Equity and Inclusion
fr: Diversité, Équité et Inclusion

source: Whatever you deem appropriate - it’s your conference after all
fr: Tout ce que vous jugez approprié - c'est votre conférence après tout.

source: This year's edition will feature a new Pan-African open source event running alongside DjangoCon Africa - UbuCon at DjangoCon Africa!
fr: L'édition de cette année comprendra un nouvel événement panafricain sur les logiciels libres qui se déroulera en parallèle de DjangoCon Africa - UbuCon at DjangoCon Africa!

source: We invite proposals on any of these topics, and more: Desktop, Cloud and Infrastructure, Linux Containers and Container Orchestration, DevOps, Virtualisation, Automation, Networking Windows Subsystem for Linux(WSL), IoT, Embedded, Robotics, Appliances, Packaging, Documentation, QA and Bug triage, Security, Compliance and Kernel, Data and AI, Video, Audio and Image editing, Open source tools, Community, Diversity, Local Outreach and Social Context.
fr: Nous vous invitons à soumettre des propositions sur l'un ou l'autre de ces sujets, et plus encore : Desktop, Cloud et Infrastructure, Conteneurs Linux et Orchestration de Conteneurs, DevOps, Virtualisation, Automatisation, Mise en réseau Windows Subsystem for Linux(WSL), IoT, Embarqué, Robotique, Appareils, Packaging, Documentation, QA et Triage de bugs, Sécurité, Conformité et Noyau, Données et IA, Vidéo, Audio et Edition d'images, Outils open source, Communauté, Diversité, Sensibilisation locale et Contexte social.

source: Speaker Perks
fr: Avantages pour les Orateurs

source: As a speaker at DjangoCon Africa, you will enjoy premium access to our complimentary dinner and prioritised in Opportunity Grants. However, if you need financial assistance of any sort to attend the conference, you will need to apply for an opportunity grant separately and mention that you applied during your speaking application or proposal. Please note that speakers are considered as first choice in issuing grants across.
fr: En tant qu'orateur à DjangoCon Africa, vous bénéficierez d'un accès privilégié à notre dîner gratuit et d'une priorité dans les bourses. Cependant, si vous avez besoin d'une quelconque assistance financière pour participer à la conférence, vous devrez vous devrez soumettre une demande de bourse séparément et le mentionner dans votre application ou proposition de présentation. Veuillez noter que les orateurs sont prioritaires dans l'attribution des bourses.

source: Company Support
fr: Soutien de l'entreprise

source: If your company or employer has supported your talk preparation, such as allowing you to work on it during office hours, you're welcome to acknowledge their support during your presentation. However, please ensure that the talk's content remains unbiased and focused on sharing your expertise, rather than promoting commercial interests.
fr: Si votre entreprise ou votre employeur vous a soutenu dans la préparation de votre présentation, en vous autorisant par exemple à y travailler pendant les heures de bureau, vous êtes invité à le mentionner lors de votre présentation. Veillez toutefois à ce que le contenu de la présentation reste impartial et axé sur le partage de votre expertise, plutôt que sur la promotion d'intérêts commerciaux.

source: Don't let self-doubt hold you back - DjangoCon Africa is eager to showcase your unique perspective and expertise, and reading inspiring stories from past speakers can help boost your confidence and encourage you to submit your proposal.
fr: Ne laissez pas le doute vous freiner - DjangoCon Africa est désireuse de mettre en valeur votre perspective et votre expertise uniques, et lire les histoires inspirantes d'anciens orateurs peut vous aider à reprendre confiance et à soumettre votre proposition.

source: If you would like to ask a question, you are always welcome to write the Content Committee: <a href="mailto:content@djangocon.africa">content@djangocon.africa</a>.
fr: Si vous souhaitez poser une question, vous pouvez toujours écrire au Comité de Contenu: <a href="mailto:content@djangocon.africa">content@djangocon.africa</a>.

source: Join us for another exciting edition of DjangoCon Africa!
fr: Rejoignez-nous pour une nouvelle édition fascinante de DjangoCon Africa !

source: Be a part of a thriving community of developers and position your brand at the forefront of the rapidly growing technology sector in Africa. With an expected 300 attendees from both the local and international community, sponsoring this landmark event is a unique opportunity to connect with and reach a highly engaged audience.
fr: Faites partie d'une communauté florissante de développeurs et positionnez votre marque à la pointe du secteur technologique en pleine croissance en Afrique. Avec 300 participants attendus de la communauté locale et internationale, le sponsoring de cet événement phare est une occasion unique d'entrer en contact avec un public très engagé.

source: Download Sponsorship Brochure
fr: Télécharger la brochure de sponsoring

source: Look who’s sponsoring us
fr: Découvrez qui nous sponsorise

source: If you are interested in becoming a sponsor or if you have any questions, then please email us at <a href="mailto:sponsors@djangocon.africa"></a>sponsors@djangocon.africa.
fr: Si vous souhaitez devenir un sponsor ou si vous avez des questions, envoyez-nous un courriel à <a href="mailto:sponsors@djangocon.africa"></a>sponsors@djangocon.africa.

source: Why sponsor?
fr: Pourquoi nous sponsoriser ?
